Catalogs/Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Счета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Платформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключенКСтратегии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ms_ФормаРабочийСтол/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьСчетаПользователяТИнвест(Команда)
	
	ПолучитьСчетаПользователяТИнвестНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСчетаПользователяТИнвестНаСервере()
	СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
	ИнтеграцияTInvestAPI.TI_ПолучитьСчетаПользователя(, СоединениеTInvest);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПортфель(Команда)
	
	Состояние("Загрузка данных по счетам...");
	ПолучитьПортфельПоСчетамНаСервере();
	ОткрытьФорму("РегистрСведений.ИмпортДанныхБрокера.ФормаСписка");
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Процедура ПолучитьПортфельПоСчетамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Счета.Ссылка КАК Ссылка,
		|	Счета.AccountId КАК AccountId,
		|	Счета.Представление КАК Представление
		|ИЗ
		|	Справочник.Счета КАК Счета
		|ГДЕ
		|	Счета.Платформа = ЗНАЧЕНИЕ(Справочник.Платформы.ТИнвестиции)
		|	И Счета.Активен
		|	И НЕ Счета.ПодключенКСтратегии";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСчета = РезультатЗапроса.Выбрать();
	Пока ВыборкаСчета.Следующий() Цикл
		ИнтеграцияTInvestРыночныеДанные.ЗагрузитьПортфельПоСчету(ВыборкаСчета);
	КонецЦикла;

КонецПроцедуры // ПолучитьПортфельПоСчетамНаСервере()
